[
    {
        "id": "563fe3a7df80469dbb2d061199c55d0c",
        "title": "Briose Delicioase",
        "previewHtml": "Învățați cum să pregătiți aceste briose adorabile și delicioase care vă vor topi inima.",
        "previewImage": {
            "url": "assets/img/preview/5a034b57c3e14c1da33c877a09ec8607.jpg",
            "description": "Briosa drăguță"
        },
        "textHtml": "",
        "ingredients": [
            "1 3/4 căni de făină albă",
            "1 cană de zahăr granulat",
            "1/2 cană de unt nesarat, la temperatura camerei",
            "2 ouă mari",
            "1 linguriță extract de vanilie"
        ],
        "instructions": [
            "Preîncălziți cuptorul la 350°F (175°C). Așezați hârtii speciale pentru brioșe în forme.",
            "Într-un castron, mixați untul și zahărul până obțineți o compoziție ușoară și pufoasă.",
            "Adăugați ouăle unul câte unul, amestecând bine după fiecare adăugare. Adăugați extractul de vanilie.",
            "Adăugați treptat făina și amestecați până la omogenizare. Nu amestecați prea mult.",
            "Puneți aluatul în hârtiile pentru brioșe, umplând fiecare formă cam doi treimi.",
            "Coaceți timp de 18-20 minute sau până când un scobitoare introdusă în centrul brioșelor iese curată."
        ]
    },
    {
        "id": "83151d0a33124b6da13d98708a052169",
        "title": "Prăjituri cu Bucăți de Ciocolată",
        "previewHtml": "Delicioase prăjituri cu bucăți de ciocolată făcute în casă care se topesc în gură!",
        "previewImage": {
            "url": "assets/img/preview/724ac9a34be94679b30930834700207f.jpg",
            "description": "Prăjituri cu bucăți de ciocolată"
        },
        "textHtml": "Aceste prăjituri clasice cu bucăți de ciocolată sunt perfecte pentru orice ocazie.",
        "ingredients": [
            "1 cană de unt nesarat, la temperatura camerei",
            "1 cană de zahăr alb",
            "1 cană de zahăr brun",
            "2 ouă",
            "1 linguriță extract de vanilie",
            "3 căni de făină albă",
            "1 linguriță bicarbonat de sodiu",
            "2 lingurițe apă caldă",
            "1/2 linguriță sare",
            "2 căni de chipsuri de ciocolată semiamară"
        ],
        "instructions": [
            "Preîncălziți cuptorul la 350°F (175°C).",
            "Mixați untul, zahărul alb și zahărul brun până obțineți o compoziție uniformă.",
            "Adăugați ouăle unul câte unul, apoi amestecați vanilia.",
            "Dizolvați bicarbonatul de sodiu în apa caldă. Adăugați-l în compoziție împreună cu sarea.",
            "Amestecați făina și chipsurile de ciocolată.",
            "Puneți cu lingura compoziția pe tăvi neunse.",
            "Coaceți timp de aproximativ 10 minute sau până când marginile sunt frumos rumenite."
        ]
    },
    {
        "id": "21e721dc82c445f7a045c70b75d5e049",
        "title": "Briose de Vanilie",
        "previewHtml": "Briose pufoase și delicate de vanilie perfecte pentru sărbători!",
        "previewImage": {
            "url": "assets/img/preview/c970c38e0b5e410599c7022003e4a3e3.jpg",
            "description": "Briose de vanilie"
        },
        "textHtml": "Aceste briose de vanilie sunt o delicatesă delicioasă pentru toate vârstele.",
        "ingredients": [
            "1 1/2 căni de făină albă",
            "1 1/2 lingurițe praf de copt",
            "1/4 linguriță sare",
            "1/2 cană de unt nesarat, la temperatura camerei",
            "1 cană de zahăr alb",
            "2 ouă",
            "2 lingurițe extract de vanilie",
            "1/2 cană de lapte"
        ],
        "instructions": [
            "Preîncălziți cuptorul la 350°F (175°C).",
            "Așezați hârtii speciale pentru brioșe în forme.",
            "Într-un bol mediu, amestecați făina, praful de copt și sarea.",
            "În alt bol, mixați untul și zahărul până obțineți o compoziție pufoasă.",
            "Adăugați ouăle unul câte unul, apoi amestecați extractul de vanilie.",
            "Încorporați treptat ingredientele uscate, alternând cu laptele.",
            "Turnați aluatul în formele pregătite pentru brioșe.",
            "Coaceți timp de 15-18 minute sau până când un scobitoare introdusă în centrul brioșelor iese curată."
        ]
    },
    {
        "id": "276d0702a30e479a8d1e212f399f60f4",
        "title": "Prăjitură cu Căpșuni",
        "previewHtml": "Un desert delicios cu căpșuni proaspete și frișcă pufoasă.",
        "previewImage": {
            "url": "assets/img/preview/055f23cfe4704184a758ed3be1951da1.jpg",
            "description": "Prăjitură cu căpșuni"
        },
        "textHtml": "Încântați-vă cu acest desert clasic de vară, cu straturi de blat pufos, căpșuni suculente și frișcă pufoasă.",
        "ingredients": [
            "2 căni de făină albă",
            "1/4 cană de zahăr granulat",
            "1 lingură praf de copt",
            "1/2 linguriță sare",
            "1/2 cană de unt nesarat, rece și tăiat cubulețe",
            "3/4 cană de lapte",
            "2 căni de căpșuni tăiate felii",
            "2 linguri de zahăr granulat (pentru căpșuni)",
            "1 cană de frișcă lichidă",
            "2 linguri de zahăr pudră",
            "1 linguriță extract de vanilie"
        ],
        "instructions": [
            "Preîncălziți cuptorul la 425°F (220°C) și așezați o foaie de copt pe o tavă pentru copt.",
            "Într-un bol, combinați făina, zahărul, praful de copt și sarea. Adăugați untul rece și fărâmițați-l cu degetele până obțineți un amestec granulos.",
            "Adăugați laptele și amestecați până la omogenizare. Nu amestecați prea mult.",
            "Transferați aluatul pe o suprafață presărată cu făină și aplanați-l într-un cerc de aproximativ 1 inch grosime. Taiați cercuri folosind un decupator de biscuiți și așezați-le pe foaia pregătită pentru copt.",
            "Coaceți timp de 12-15 minute sau până când prăjiturile sunt aurii. Lăsați-le să se răcească.",
            "Într-un alt bol, amestecați căpșunile tăiate cu zahăr și lăsați-le să macereze timp de aproximativ 15-20 de minute.",
            "Într-un bol separat, bateți frișca lichidă, zahărul pudră și extractul de vanilie până obțineți vârfuri rigide.",
            "Pentru asamblare, tăiați prăjiturile în jumătate, puneți căpșunile pe jumătatea de jos, adăugați o lingură de frișcă și acoperiți cu jumătatea de sus a prăjiturilor."
        ]
    },
    {
        "id": "c29f437e480d49839e8a36cf5829dcb2",
        "title": "Limonadă de Zmeură",
        "previewHtml": "Limonadă racoritoare și aromată de zmeură perfectă pentru vară.",
        "previewImage": {
            "url": "assets/img/preview/bae47ed03a114163a8f693ada1ba3988.jpg",
            "description": "Limonadă de zmeură"
        },
        "textHtml": "Această limonadă de zmeură făcută în casă combină dulceața zmeurelor cu prospețimea lămâilor stoarse proaspăt.",
        "ingredients": [
            "1 cană de zmeură proaspătă",
            "1 cană de zahăr granulat",
            "1 cană de suc proaspăt stors de lămâie",
            "4 căni de apă rece",
            "Cuburi de gheață",
            "Zmeură proaspătă și felii de lămâie pentru decor"
        ],
        "instructions": [
            "Într-un blender, faceți piure zmeura și strecurați amestecul printr-un sită cu ochiuri fine pentru a elimina semințele.",
            "Într-o carafă, combinați piureul de zmeură, zahărul granulat, sucul de lămâie și apa rece. Amestecați până când zahărul se dizolvă.",
            "Refrigerați limonada pentru cel puțin 1-2 ore pentru a o răci.",
            "Pentru servire, umpleți paharele cu cuburi de gheață, turnați limonada de zmeură și decorați cu zmeură proaspătă și felii de lămâie."
        ]
    },
    {
        "id": "a1b3e237ff7c48b1bfa83c3c26e7a84d",
        "title": "Muffins cu Afine",
        "previewHtml": "Muffins delicioși și suculenți cu afine pentru micul dejun.",
        "previewImage": {
            "url": "assets/img/preview/6e8762cb0ceb47d2b89de658bad2c8e8.jpg",
            "description": "Muffins cu Afine"
        },
        "textHtml": "Acești muffins cu afine sunt plini de afine suculente și au o miez moale care îi face irezistibili.",
        "ingredients": [
            "2 căni făină albă",
            "1 lingură praf de copt",
            "1/2 linguriță sare",
            "1/2 ceașcă unt nesărat, topit și răcit",
            "1 ceașcă zahăr granulat",
            "2 ouă mari",
            "1 linguriță extract de vanilie",
            "1/2 ceașcă lapte",
            "1 1/2 căni afine proaspete"
        ],
        "instructions": [
            "Preîncălziți cuptorul la 375°F (190°C) și așezați hârtii de copt în formele de muffin.",
            "Într-un bol, amestecați făina, praful de copt și sarea.",
            "Într-un alt bol, amestecați untul topit, zahărul, ouăle și extractul de vanilie până se combină bine.",
            "Adăugați treptat ingredientele uscate în cele umede, alternând cu laptele, și amestecați până se combină bine.",
            "Adăugați cu grijă afinele în compoziție.",
            "Umpleți formele de muffin pregătite cu compoziția, umplând fiecare formă aproximativ două treimi.",
            "Coaceți timp de 18-20 de minute sau până când un băț de chibrit introdus în mijloc iese curat.",
            "Permiteți muffinselor să se răcească în formele de copt câteva minute înainte de a le transfera pe un grătar pentru a se răci complet."
        ]
    },
    {
        "id": "8d7f123460c6415c90e5a6f80562c7a9",
        "title": "Smoothie cu Unt de Arahide",
        "previewHtml": "Realizează un smoothie cremos și satisfăcător cu unt de arahide, chiar la tine acasa.",
        "previewImage": {
            "url": "assets/img/preview/13eb5ac260b84b059977e96455054d50.jpg",
            "description": "Smoothie cu Unt de Arahide"
        },
        "textHtml": "Acest smoothie cu unt de arahide este o combinație delicioasă de unt de arahide cremos, banane și un strop de miere.",
        "ingredients": [
            "1 banană coaptă, curățată și congelată",
            "2 linguri unt de arahide cremos",
            "1 ceașcă lapte de migdale fără zahăr (sau orice alt lapte preferat)",
            "1 lingură miere sau sirop de arțar (opțional)",
            "Cuburi de gheață"
        ],
        "instructions": [
            "Într-un blender, combinați banana congelată, untul de arahide, laptele de migdale și mierea (dacă folosiți).",
            "Amestecați până obțineți un smoothie cremos.",
            "Adăugați cuburi de gheață dacă doriți și amestecați din nou până obțineți o consistență fină.",
            "Turnați smoothie-ul într-un pahar și savurați-l imediat."
        ]
    },
    {
        "id": "4f36b29115e54069afade9a1a5ac6e0d",
        "title": "Pizza Făcută în Casă",
        "previewHtml": "Creează pizza ta preferată acasă cu toppinguri proaspete.",
        "previewImage": {
            "url": "assets/img/preview/31216483a63d4c56888a7d1f3aafef90.jpg",
            "description": "Pizza Făcută în Casă"
        },
        "textHtml": "Transformă seara de pizza într-un succes cu această rețetă de pizza făcută în casă. Personalizează-o cu toppingurile tale preferate!",
        "ingredients": [
            "1 porție de aluat pentru pizza (făcut în casă sau cumpărat)",
            "1/2 ceașcă sos de pizza",
            "2 căni brânză mozzarella rasă",
            "Toppinguri variate: felii de pepperoni, ardei gras, ceapă, ciuperci, măsline, etc."
        ],
        "instructions": [
            "Preîncălziți cuptorul la 475°F (245°C) sau conform instrucțiunilor pentru aluatul de pizza.",
            "Întindeți aluatul de pizza pe o suprafață ușor presărată cu făină, în forma și grosimea dorită.",
            "Distribuiți uniform sosul de pizza peste aluat, lăsând o margine pentru crustă.",
            "Presărați brânza mozzarella rasă peste sos și adăugați toppingurile preferate.",
            "Transferați cu grijă pizza pe o tavă de copt sau pe o piatră de pizza.",
            "Coaceți în cuptorul preîncălzit timp de 12-15 minute sau până când crusta este aurie iar brânza este topită și a făcut bule.",
            "Tăiați și serviți pizza caldă."
        ]
    },
    {
        "id": "9eaae45f6b634d288d00d96c99749c92",
        "title": "Chec cu Banane",
        "previewHtml": "Chec umed și aromat cu banane pentru o gustare reconfortantă.",
        "previewImage": {
            "url": "assets/img/preview/a235d3e3415540c99516aa472844a092.jpg",
            "description": "Chec cu Banane"
        },
        "textHtml": "Această rețetă de chec cu banane produce o cocă umedă, moale și îmbibată cu dulceața bananelor coapte.",
        "ingredients": [
            "2 căni făină albă",
            "1 linguriță bicarbonat de sodiu",
            "1/4 linguriță sare",
            "1/2 ceașcă unt nesărat, topit",
            "3/4 ceașcă zahăr granulat",
            "2 ouă mari, bătute",
            "3-4 banane coapte, pasate",
            "1/3 ceașcă lapte",
            "1 linguriță extract de vanilie",
            "Adițional, pentru adăugat (opțional): nuci tocate, fulgi de ciocolată"
        ],
        "instructions": [
            "Preîncălziți cuptorul la 350°F (175°C) și ungeți o tavă de copt de 9x5 inch.",
            "Într-un bol, amestecați făina, bicarbonatul de sodiu și sarea.",
            "În alt bol, amestecați untul topit și zahărul. Adăugați ouăle bătute, bananele pasate, laptele și extractul de vanilie. Amestecați până se combină bine.",
            "Adăugați treptat ingredientele uscate în cele umede și amestecați până se combină. Nu amestecați prea mult.",
            "Dacă doriți, adăugați nucile tocate sau fulgii de ciocolată.",
            "Turnați compoziția în tava pregătită și coaceți timp de 60-65 de minute sau până când un băț de chibrit introdus în mijloc iese curat.",
            "Permiteți checului cu banane să se răcească în tavă timp de 10 minute înainte de a-l transfera pe un grătar pentru a se răci complet."
        ]
    },
    {
        "id": "2b77cd0d1e5c4b218fa32bc945d5e0b7",
        "title": "Paste Alfredo cu Pui",
        "previewHtml": "Paste cremoase și aromate Alfredo cu pui pentru o masă reconfortantă.",
        "previewImage": {
            "url": "assets/img/preview/7104286463614d12924f8888ed59bc5f.jpg",
            "description": "Paste Alfredo cu Pui"
        },
        "textHtml": "Bucurați-vă de o porție reconfortantă de paste cremoase Alfredo cu pui și sos Alfredo bogat.",
        "ingredients": [
            "8 uncii paste fettuccine",
            "2 piepturi de pui fără piele și os, tăiate în fâșii",
            "2 linguri ulei de măsline",
            "3 căței de usturoi, mărunțiți",
            "1 ceașcă smântână lichidă",
            "1/2 ceașcă parmezan ras",
            "Sare și piper după gust",
            "Pătrunjel proaspăt pentru garnitură"
        ],
        "instructions": [
            "Gătiți pastele fettuccine conform instrucțiunilor de pe ambalaj. Scurgeți-le și lăsați-le deoparte.",
            "Condimentați fâșiile de pui cu sare și piper.",
            "Într-o tigaie, încălziți uleiul de măsline la foc mediu-mare. Adăugați fâșiile de pui condimentate și gătiți-le până devin aurii și sunt gătite. Scoateți puiul din tigaie și lăsați-l deoparte.",
            "În aceeași tigaie, adăugați usturoiul mărunțit și gătiți-l până devine aromat. Turnați smântâna lichidă, reduceți focul la minim și lăsați să fiarbă timp de 2-3 minute.",
            "Amestecați parmezanul ras în sos până se îngroașă. Condimentați cu sare și piper după gust.",
            "Adăugați fettuccinele gătite în tigaie și amestecați pentru a acoperi pastele cu sos.",
            "Serviți pastele cu sos Alfredo deasupra și garnisite cu fâșii de pui gătite și pătrunjel proaspăt."
        ]
    },
    {
        "id": "3c69277a4a654f77aeb8f1325b53d977",
        "title": "Salată de Fructe",
        "previewHtml": "Salată colorată și răcoritoare de fructe pentru o gustare sănătoasă.",
        "previewImage": {
            "url": "assets/img/preview/e2df39384bf942628c8658f70226ab95.jpg",
            "description": "Salată de Fructe"
        },
        "textHtml": "Această salată de fructe este o combinație vibrantă de fructe proaspete amestecate într-un dressing ușor de citrice pentru o gustare răcoritoare.",
        "ingredients": [
            "2 căni căpșuni, curățate și tăiate felii",
            "2 căni cubulețe de ananas",
            "2 căni struguri, tăiați în jumătăți",
            "2 kiwi, curățate și tăiate felii",
            "2 portocale, curățate și feliate",
            "1 ceașcă afine",
            "1/4 ceașcă miere",
            "2 linguri suc proaspăt de lime",
            "Frunze proaspete de mentă pentru garnitură (opțional)"
        ],
        "instructions": [
            "Într-un bol mare, combinați căpșunile, bucățile de ananas, strugurii, kiwi-urile, portocalele și afinele.",
            "Într-un bol mic, amestecați mierea și sucul proaspăt de lime.",
            "Turnați dressingul de miere și lime peste fructe și amestecați ușor pentru a le acoperi.",
            "Racordați salata de fructe în frigider timp de cel puțin 30 de minute înainte de servire.",
            "Ornați cu frunze proaspete de mentă, dacă doriți."
        ]
    },
    {
        "id": "af72b5e109044a68b6f26ac3f356f3c0",
        "title": "Biscuiți cu Fulgi de Ovăz și Stafide",
        "previewHtml": "Biscuiți moi și mestecați cu fulgi de ovăz și stafide dulci.",
        "previewImage": {
            "url": "assets/img/preview/d6cb2d635c6b4eb8b91d571ac65e9a30.jpg",
            "description": "Biscuiți cu Fulgi de Ovăz și Stafide"
        },
        "textHtml": "Bucurați-vă de aromele reconfortante ale fulgilor de ovăz și stafidelor în acești biscuiți moi și mestecați.",
        "ingredients": [
            "1 cană unt nesărat, înmuiat",
            "1 cană zahăr brun",
            "1/2 cană zahăr granulat",
            "2 ouă mari",
            "1 linguriță extract de vanilie",
            "1 1/2 cană făină albă",
            "1 linguriță bicarbonat de sodiu",
            "1 linguriță scorțișoară măcinată",
            "1/2 linguriță sare",
            "3 cani fulgi de ovăz",
            "1 cană stafide"
        ],
        "instructions": [
            "Preîncălziți cuptorul la 350°F (175°C) și acoperiți tăvile de copt cu hârtie de copt.",
            "Într-un bol, amestecați împreună untul moale, zahărul brun și zahărul granulat până devin spumoase.",
            "Adăugați ouăle pe rând, amestecând bine după fiecare adăugare. Adăugați extractul de vanilie.",
            "Într-un alt bol, amestecați făina, bicarbonatul de sodiu, scorțișoara și sarea. Adăugați treptat ingredientele uscate la cele umede și amestecați până se combină.",
            "Încorporați cu grijă fulgii de ovăz și stafidele în aluatul pentru biscuiți.",
            "Puneți cu lingura aluatul pe tăvile pregătite, lăsând spațiu între fiecare biscuit.",
            "Coaceți timp de 10-12 minute sau până marginea biscuiților devine aurie. Lăsați biscuiții să se răcească pe tăvi câteva minute înainte de a-i transfera pe un grătar pentru răcire completă."
        ]
    },
    {
        "id": "d5408998394b4e75b3777b7773c0db00",
        "title": "Sandwich Grilled Cheese",
        "previewHtml": "Sandwich clasic și reconfortant cu brânză topită.",
        "previewImage": {
            "url": "assets/img/preview/08029bbffce44310a17df95d8dc9ebac.jpg",
            "description": "Sandwich Grilled Cheese"
        },
        "textHtml": "Bucurați-vă de brânza topită și lipicioasă între felii de pâine prăjită cu acest sandwich simplu și satisfăcător.",
        "ingredients": [
            "4 felii de pâine la alegere",
            "2 linguri unt nesărat, înmuiat",
            "2 căni brânză rasă (cheddar, mozzarella sau brânză preferată pentru topit)"
        ],
        "instructions": [
            "Preîncălziți o tigaie sau o plită la foc mediu.",
            "Ungeți o parte a fiecărei felii de pâine cu untul moale.",
            "Așezați o felie de pâine, cu partea unsă în jos, pe tigaie. Adăugați brânza rasă și acoperiți cu o altă felie de pâine, cu partea unsă în sus.",
            "Gătiți sandwich-ul timp de 3-4 minute pe fiecare parte sau până când pâinea devine aurie și brânza se topește.",
            "Repetați procesul cu restul feliilor de pâine și brânzei.",
            "Tăiați sandwich-urile grilled cheese diagonal și serviți-le fierbinți."
        ]
    }
]
